In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range("20130101", periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [7]:
df

                   A         B         C         D
2013-01-01  0.004912 -0.736125  0.668388  0.218516
2013-01-02  2.057505 -1.522269  0.612346  0.365162
2013-01-03  0.493465 -0.973913  0.621530  0.702381
2013-01-04  0.291822 -1.425158  0.231078  0.816704
2013-01-05 -0.193048 -0.602780  0.201033  0.575520
2013-01-06 -1.374062 -0.260924  0.976444 -0.992948

In [8]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [9]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [11]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
df.head()

                   A         B         C         D
2013-01-01  0.004912 -0.736125  0.668388  0.218516
2013-01-02  2.057505 -1.522269  0.612346  0.365162
2013-01-03  0.493465 -0.973913  0.621530  0.702381
2013-01-04  0.291822 -1.425158  0.231078  0.816704
2013-01-05 -0.193048 -0.602780  0.201033  0.575520

In [13]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.291822 -1.425158  0.231078  0.816704
2013-01-05 -0.193048 -0.602780  0.201033  0.575520
2013-01-06 -1.374062 -0.260924  0.976444 -0.992948

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
df.to_numpy

<bound method DataFrame.to_numpy of                    A         B         C         D
2013-01-01  0.004912 -0.736125  0.668388  0.218516
2013-01-02  2.057505 -1.522269  0.612346  0.365162
2013-01-03  0.493465 -0.973913  0.621530  0.702381
2013-01-04  0.291822 -1.425158  0.231078  0.816704
2013-01-05 -0.193048 -0.602780  0.201033  0.575520
2013-01-06 -1.374062 -0.260924  0.976444 -0.992948>

In [18]:
df2.to_numpy

<bound method DataFrame.to_numpy of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [19]:
df.describe

<bound method NDFrame.describe of                    A         B         C         D
2013-01-01  0.004912 -0.736125  0.668388  0.218516
2013-01-02  2.057505 -1.522269  0.612346  0.365162
2013-01-03  0.493465 -0.973913  0.621530  0.702381
2013-01-04  0.291822 -1.425158  0.231078  0.816704
2013-01-05 -0.193048 -0.602780  0.201033  0.575520
2013-01-06 -1.374062 -0.260924  0.976444 -0.992948>

In [20]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.004912    2.057505    0.493465    0.291822   -0.193048   -1.374062
B   -0.736125   -1.522269   -0.973913   -1.425158   -0.602780   -0.260924
C    0.668388    0.612346    0.621530    0.231078    0.201033    0.976444
D    0.218516    0.365162    0.702381    0.816704    0.575520   -0.992948

In [21]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.218516  0.668388 -0.736125  0.004912
2013-01-02  0.365162  0.612346 -1.522269  2.057505
2013-01-03  0.702381  0.621530 -0.973913  0.493465
2013-01-04  0.816704  0.231078 -1.425158  0.291822
2013-01-05  0.575520  0.201033 -0.602780 -0.193048
2013-01-06 -0.992948  0.976444 -0.260924 -1.374062

In [22]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-02  2.057505 -1.522269  0.612346  0.365162
2013-01-04  0.291822 -1.425158  0.231078  0.816704
2013-01-03  0.493465 -0.973913  0.621530  0.702381
2013-01-01  0.004912 -0.736125  0.668388  0.218516
2013-01-05 -0.193048 -0.602780  0.201033  0.575520
2013-01-06 -1.374062 -0.260924  0.976444 -0.992948

In [23]:
df["A"]

2013-01-01    0.004912
2013-01-02    2.057505
2013-01-03    0.493465
2013-01-04    0.291822
2013-01-05   -0.193048
2013-01-06   -1.374062
Freq: D, Name: A, dtype: float64

In [24]:
df[0:3]

                   A         B         C         D
2013-01-01  0.004912 -0.736125  0.668388  0.218516
2013-01-02  2.057505 -1.522269  0.612346  0.365162
2013-01-03  0.493465 -0.973913  0.621530  0.702381

In [25]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  2.057505 -1.522269  0.612346  0.365162
2013-01-03  0.493465 -0.973913  0.621530  0.702381
2013-01-04  0.291822 -1.425158  0.231078  0.816704

In [26]:
df.loc[dates[0]]

A    0.004912
B   -0.736125
C    0.668388
D    0.218516
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.004912 -0.736125
2013-01-02  2.057505 -1.522269
2013-01-03  0.493465 -0.973913
2013-01-04  0.291822 -1.425158
2013-01-05 -0.193048 -0.602780
2013-01-06 -1.374062 -0.260924

In [28]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  2.057505 -1.522269
2013-01-03  0.493465 -0.973913
2013-01-04  0.291822 -1.425158